	.section __TEXT,__text
L..LNDBG_TX:
# mark_description "Intel(R) C++ Intel(R) 64 Compiler Classic for applications running on Intel(R) 64, Version 2021.8.0 Build 20";
# mark_description "221120_000000";
# mark_description "-IHowToOptimizeGemm/ -O3 -g3 -xCore-AVX512 -qopt-zmm-usage=high -S";
	.file "intrinsic_transpose.cpp"
	.section	__TEXT, __text
L_TXTST0:
L_2__routine_start___Z37simd_square_transpose_intrinsic_16x16iiPii_0:
# -- Begin  __Z37simd_square_transpose_intrinsic_16x16iiPii
	.section	__TEXT, __text
# mark_begin;
       .align    4
	.globl __Z37simd_square_transpose_intrinsic_16x16iiPii
# --- simd_square_transpose_intrinsic_16x16(int, int, DATA_TYPE *, int)
__Z37simd_square_transpose_intrinsic_16x16iiPii:
# parameter 1(m): %edi
# parameter 2(k): %esi
# parameter 3(a): %rdx
# parameter 4(lda): %ecx
L_B1.1:                         # Preds L_B1.0
                                # Execution count [1.00e+00]
L_LCFI1:
L____tag_value___Z37simd_square_transpose_intrinsic_16x16iiPii.2:
L_L3:
                                                          #5.81
L..LN0:
        pushq     %rbp                                          #5.81
L_LCFI2:
L..LN1:
        movq      %rsp, %rbp                                    #5.81
L_LCFI3:
L..LN2:
        andq      $-64, %rsp                                    #5.81
L..LN3:
        cmpl      $16, %edi                                     #7.5
L..LN4:
        jne       L_B1.7        # Prob 21%                      #7.5
L..LN5:

//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3572
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3672
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3772
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_AT_location:
	.short 0x6501
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3872
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3972
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6172
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x39
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6272
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_AT_location:
	.short 0x9002
	.byte 0x43
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6372
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x41
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6472
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x45
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6572
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_column:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x6672
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_AT_location:
	.short 0x6901
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x6b73616d
	.byte 0x00
//	DW_AT_type:
	.long 0x000003e3
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x31786469
	.byte 0x00
//	DW_AT_type:
	.long 0x00000797
//	DW_AT_location:
	.short 0x9102
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x32786469
	.byte 0x00
//	DW_AT_type:
	.long 0x000007bd
//	DW_AT_location:
	.short 0x9102
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x33786469
	.byte 0x00
//	DW_AT_type:
	.long 0x000007c6
//	DW_AT_location:
	.short 0x9102
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x78646976
	.short 0x0031
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x16
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x78646976
	.short 0x0032
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x17
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.long 0x78646976
	.short 0x0033
//	DW_AT_type:
	.long 0x0000063f
	.byte 0x00
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.long 0x00746e69
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x000003ef
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x04
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.long 0x41544144
	.long 0x5059545f
	.short 0x0045
//	DW_AT_type:
	.long 0x000003e3
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.long 0x676e6f6c
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.long 0x646d6973
	.long 0x6172745f
	.long 0x36315f6e
	.long 0x5f363178
	.long 0x6d726570
	.long 0x78657475
	.long 0x5f726176
	.long 0x6c706e69
	.long 0x00656361
	.long 0x35335a5f
	.long 0x646d6973
	.long 0x6172745f
	.long 0x36315f6e
	.long 0x5f363178
	.long 0x6d726570
	.long 0x78657475
	.long 0x5f726176
	.long 0x6c706e69
	.long 0x50656361
	.short 0x0069
//	DW_AT_external:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x0f
//	DW_AT_type:
	.long 0x00000464
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x000003e3
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x0000046e
//	DW_TAG_const_type:
	.byte 0x10
//	DW_AT_type:
	.long 0x00000473
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.long 0x64696f76
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x00000480
//	DW_TAG_const_type:
	.byte 0x10
//	DW_AT_type:
	.long 0x00000485
//	DW_TAG_union_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x22
//	DW_AT_decl_column:
	.byte 0x23
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_name:
	.long 0x326d5f5f
	.long 0x00693635
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x28
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x63675f69
	.long 0x6f635f63
	.long 0x7461706d
	.long 0x6c696269
	.long 0x00797469
//	DW_AT_type:
	.long 0x0000055c
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2a
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x38695f69
	.byte 0x00
//	DW_AT_type:
	.long 0x00000565
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x31695f69
	.short 0x0036
//	DW_AT_type:
	.long 0x00000576
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x33695f69
	.short 0x0032
//	DW_AT_type:
	.long 0x00000588
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x36695f69
	.short 0x0034
//	DW_AT_type:
	.long 0x00000591
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x38755f69
	.byte 0x00
//	DW_AT_type:
	.long 0x0000059a
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x31755f69
	.short 0x0036
//	DW_AT_type:
	.long 0x000005b4
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x33755f69
	.short 0x0032
//	DW_AT_type:
	.long 0x000005cf
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3635326d
	.long 0x36755f69
	.short 0x0034
//	DW_AT_type:
	.long 0x000005e8
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x00000401
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x0000056e
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.long 0x72616863
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x0000057f
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.long 0x726f6873
	.short 0x0074
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000003e3
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x00000401
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005a3
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.long 0x69736e75
	.long 0x64656e67
	.long 0x61686320
	.short 0x0072
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005bd
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.long 0x69736e75
	.long 0x64656e67
	.long 0x6f687320
	.short 0x7472
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005d8
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.long 0x69736e75
	.long 0x64656e67
	.long 0x746e6920
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005f1
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.long 0x69736e75
	.long 0x64656e67
	.long 0x6e6f6c20
	.short 0x0067
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x00000607
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_column:
	.byte 0x03
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.long 0x326d5f5f
	.long 0x00693635
//	DW_AT_type:
	.long 0x00000485
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x23
//	DW_AT_decl_column:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.long 0x6d6d5f5f
	.long 0x386b7361
	.byte 0x00
//	DW_AT_type:
	.long 0x000005a3
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x24
//	DW_AT_decl_column:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.long 0x6d6d5f5f
	.long 0x316b7361
	.short 0x0036
//	DW_AT_type:
	.long 0x000005bd
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.long 0x00000473
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x52
//	DW_AT_decl_column:
	.byte 0x03
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.long 0x356d5f5f
	.long 0x00693231
//	DW_AT_type:
	.long 0x0000064f
//	DW_TAG_union_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x41
//	DW_AT_decl_column:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x40
//	DW_AT_name:
	.long 0x356d5f5f
	.long 0x00693231
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x63675f69
	.long 0x6f635f63
	.long 0x7461706d
	.long 0x6c696269
	.long 0x00797469
//	DW_AT_type:
	.long 0x0000073d
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x38695f69
	.byte 0x00
//	DW_AT_type:
	.long 0x00000746
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x31695f69
	.short 0x0036
//	DW_AT_type:
	.long 0x0000074f
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x33695f69
	.short 0x0032
//	DW_AT_type:
	.long 0x00000758
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x36695f69
	.short 0x0034
//	DW_AT_type:
	.long 0x00000761
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4d
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x38755f69
	.byte 0x00
//	DW_AT_type:
	.long 0x0000076a
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x31755f69
	.short 0x0036
//	DW_AT_type:
	.long 0x00000773
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x33755f69
	.short 0x0032
//	DW_AT_type:
	.long 0x0000077c
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x50
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x3231356d
	.long 0x36755f69
	.short 0x0034
//	DW_AT_type:
	.long 0x00000785
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x51
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.short 0x2302
	.byte 0x00
//	DW_AT_name:
	.long 0x356d5f5f
	.long 0x5f693231
	.long 0x00323369
//	DW_AT_type:
	.long 0x0000078e
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x00000401
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x0000056e
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x3f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x0000057f
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000003e3
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x00000401
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005a3
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x3f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005bd
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005d8
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000005f1
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000003e3
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000007a0
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x1e
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.long 0x36746e69
	.long 0x00745f34
//	DW_AT_type:
	.long 0x000007b0
//	DW_TAG_base_type:
	.byte 0x0b
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.long 0x676e6f6c
	.long 0x6e6f6c20
	.short 0x0067
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000007a0
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x13
//	DW_AT_type:
	.long 0x000007cf
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x14
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x1e
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.long 0x33746e69
	.long 0x00745f32
//	DW_AT_type:
	.long 0x000003e3
//	DW_TAG_subprogram:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_abstract_origin:
	.long 0x00000409
//	DW_AT_frame_base:
	.short 0x7702
	.byte 0x00
//	DW_AT_low_pc:
	.quad L_L17
//	DW_AT_high_pc:
	.quad L..LN__Z35simd_tran_16x16_permutexvar_inplacePi.303
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_column:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.long 0x00000464
//	DW_AT_name:
	.long 0x0074616d
//	DW_AT_location:
	.short 0x5501
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.short 0x3074
	.byte 0x00
//	DW_AT_type:
	.long 0x0000063f
//	DW_TAG_variable:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_column:
	.byte 0x11
